# 데이터 구조 list 개념
"""
list는 데이터 구조라고 부르는 것 중 하나이다.
데이터 구조란 파이썬에서 데이터를 체계화하고 저장하는 방식을 말한다.
데이터를 그룹화하여 저장하거나, 데이터들의 순서를 지정해야할 때도 중요하게 사용된다.
ex) 미국의 모든 주를 하나의 변수에 저장하기, 순서가 있는 가상화 번호를 하나의 변수에 저장하기
"""

fruits = ['item1', 'item2']

"""
파이썬 자료 구조에서는 모든 데이터 형식을 저장할 수 있다.
또한 혼합된 데이터 형식을 저장할 수 있는 큰 장점이 존재한다.
파이선에서 중요한 것은 구문이다. 파이썬 리스트는 항상 윗처럼 대괄호를 열어 시작하고 닫는다.
그리고 대괄호의 사이에는 쉼표로 구분한다.
"""

# 모든 미국 주 list에 저장해보기
states_of_america = ["Delaware", "Pennsylvania"]
# 어떤 주가 처음으로 미국에 편입되었는지 확인
print(states_of_america[0])

"""
여기서 컴퓨터와 프로그래밍의 특성을 발견할 수 있다.
보통은 첫번째는 1이라는 개념을 가지고 있지만
프로그래밍에서 메모리의 첫번째 주소는 0이다.
즉 위치라는 개념보다 인덱스 숫자 개념으로 접근하면 이해하기 쉽다. 
"""

# 마이너스 인덱스로 list 출력해보기 (마이너스는 마지막 인덱스부터 시작)
print(states_of_america[-1])
# 인덱스 값 변경해보기
states_of_america[1] = "Pencilvania"
print(states_of_america[1])
# 리스트에 값 추가해보기
states_of_america.append("Oklahoma")
print(states_of_america)

"""
이외에 다양한 함수가 있지만 중요한 것은 모든 것을 기억할 필요는 없다는 것이다.
자료와 구글이 존재하는 이유는 세상에 암기할 수 없을 정도로 많은 정보가 존재하기 때문이고
암기는 효율적이지 않은 학습 방식이다.
이는 어떻게 일이 진행되는 지와 같은 중요한 일을 처리하기 위해 필요한 뇌의 능력을 낭비하는것이며
중요한 일이란 작동의 원리와 원하는 작업을 처리하는 방법을 학습하는 것이다.
"""








