"""
나는 파이참을 첫 강의부터 사용했지만
15일차 부터 파이선 설치, 파이참 설명을 진행한다.
파이참이 파이썬 개발자들에게 어떠한 추가적인 편의성을 제공하는지 알아보자.

1. 코드 맞춤법 검사 기능
    - 코드를 작성할 때 key, value print 변수명등을 입력할텐데
    이 때 작성한 영어 단어의 스펠링과 문법을 검사해주는 기능을 제공한다.

2. 넓은 개발 공간 제공
    - 개발 공간이 넓어 여러 개의 작업 창을 한 화면에 함께 띄울 수 있어
    능률이 상승한다.

3. 린터가 기본적으로 제공되어 있다.
    - 린터는 옷에 묻은 먼지를 떼어내는 도구로서
    IDE에서도 비슷한 기능을 제공해준다.
    즉 기본적인 파이썬 코딩 스타일링을 가이드 해주는 역활이다.

4. 로컬 작업 내역을 확인할 수 있다. (git 적용 안했을 시)
    - 만일 작업하다 작업물이 날라 갔을 경우 로컬 히스토리를 통해
    원복 할 수 있는 큰 장점을 제공한다.

5. 스트럭쳐 기능
    - 작성한 코드를 분류하는 기능이다.
    파이선 파일 내에 변수, 함수들을 빠르게 찾을 수 있다.

6. 리팩토링 기능
    - 한번에 함수나 변수 명을 변경하고 싶을 때 사용된다.
    아래는 test2 함수를 sum_number_fn으로 리네임 해보았다.
"""


def sum_number_fn(n1, n2):
    total = n1 + n2
    return total


print(sum_number_fn(2, 3))

